lkolbly/cmsis-svd/data/TexasInstruments/LM3S6950.svd
        <register>
          <name>LDOPCTL</name>
          <description>LDO Power Control</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_LDOPCTL</name>
              <description>LDO Output Voltage</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_50V</name>
                  <description>2.50</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_45V</name>
                  <description>2.45</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_40V</name>
                  <description>2.40</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_35V</name>
                  <description>2.35</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_30V</name>
                  <description>2.30</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_25V</name>
                  <description>2.25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_75V</name>
                  <description>2.75</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_70V</name>
                  <description>2.70</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_65V</name>
                  <description>2.65</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_60V</name>
                  <description>2.60</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_LDOPCTL_2_55V</name>
                  <description>2.55</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR0_HIB</name>
              <description>HIB Reset Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR1</name>
          <description>Software Reset Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR1_UART0</name>
              <description>UART0 Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_UART1</name>
              <description>UART1 Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_UART2</name>
              <description>UART2 Reset Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_SSI0</name>
              <description>SSI0 Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_SSI1</name>
              <description>SSI1 Reset Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_QEI0</name>
              <description>QEI0 Reset Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_I2C0</name>
              <description>I2C0 Reset Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER0</name>
              <description>Timer 0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER1</name>
              <description>Timer 1 Reset Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER2</name>
              <description>Timer 2 Reset Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER3</name>
              <description>Timer 3 Reset Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP0</name>
              <description>Analog Comp 0 Reset Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP1</name>
              <description>Analog Comp 1 Reset Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP2</name>
              <description>Analog Comp 2 Reset Control</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR2</name>
          <description>Software Reset Control 2</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR2_GPIOA</name>
              <description>Port A Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOB</name>
              <description>Port B Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOC</name>
              <description>Port C Reset Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOD</name>
              <description>Port D Reset Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOE</name>
              <description>Port E Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOF</name>
              <description>Port F Reset Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOG</name>
              <description>Port G Reset Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_EMAC0</name>
              <description>MAC0 Reset Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_EPHY0</name>
              <description>PHY0 Reset Control</description>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RIS_BORRIS</name>
              <description>Brown-Out Reset Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_IMC_BORIM</name>
              <description>Brown-Out Reset Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MISC_BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC</name>
          <description>Run-Mode Clock Configuration</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCC_MOSCDIS</name>
              <description>Main Oscillator Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_IOSCDIS</name>
              <description>Internal Oscillator Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_OSCSRC</name>
              <description>Oscillator Source</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_MAIN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT</name>
                  <description>IOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_INT4</name>
                  <description>IOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_OSCSRC_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_XTAL</name>
              <description>Crystal Value</description>
              <bitRange>[9:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_1MHZ</name>
                  <description>1 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_1_84MHZ</name>
                  <description>1.8432 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_2MHZ</name>
                  <description>2 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_2_45MHZ</name>
                  <description>2.4576 MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_3_57MHZ</name>
                  <description>3.579545 MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_3_68MHZ</name>
                  <description>3.6864 MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4MHZ</name>
                  <description>4 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_09MHZ</name>
                  <description>4.096 MHz</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_4_91MHZ</name>
                  <description>4.9152 MHz</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5MHZ</name>
                  <description>5 MHz</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_5_12MHZ</name>
                  <description>5.12 MHz</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6MHZ</name>
                  <description>6 MHz</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_6_14MHZ</name>
                  <description>6.144 MHz</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_7_37MHZ</name>
                  <description>7.3728 MHz</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8MHZ</name>
                  <description>8 MHz</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_XTAL_8_19MHZ</name>
                  <description>8.192 MHz</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_BYPASS</name>
              <description>PLL Bypass</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_PWRDN</name>
              <description>PLL Power Down</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_PWMDIV</name>
              <description>PWM Unit Clock Divisor</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_2</name>
                  <description>PWM clock /2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_4</name>
                  <description>PWM clock /4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_8</name>
                  <description>PWM clock /8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_16</name>
                  <description>PWM clock /16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_32</name>
                  <description>PWM clock /32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_PWMDIV_64</name>
                  <description>PWM clock /64</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_USEPWMDIV</name>
              <description>Enable PWM Clock Divisor</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_USESYSDIV</name>
              <description>Enable System Clock Divider</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC_SYSDIV</name>
              <description>System Clock Divisor</description>
              <bitRange>[26:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_5</name>
                  <description>System clock /5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_6</name>
                  <description>System clock /6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_7</name>
                  <description>System clock /7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_8</name>
                  <description>System clock /8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_9</name>
                  <description>System clock /9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_10</name>
                  <description>System clock /10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_11</name>
                  <description>System clock /11</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_12</name>
                  <description>System clock /12</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_13</name>
                  <description>System clock /13</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_14</name>
                  <description>System clock /14</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_15</name>
                  <description>System clock /15</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC_SYSDIV_16</name>
                  <description>System clock /16</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC_ACG</name>
              <description>Auto Clock Gating</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFG</name>
          <description>XTAL to PLL Translation</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PLLCFG_R</name>
              <description>PLL R Value</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PLLCFG_F</name>
              <description>PLL F Value</description>
              <bitRange>[13:5]</bitRange>
            </field>
          </fields>
        </register>
